Documents/ВозвратСКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВозвратСКомиссии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаКомиссии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссионера</Name>
					<Comment>Сумма по к-рой товар передан на комиссию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Comment>в валюте док-та продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаценкаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВозвратСКомиссии/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
    Количество = Товары.Итог("Количество");
	Сумма = Товары.Итог("Сумма");

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаТовары = ТаблицаТовары();
	ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Движения.ОстаткиТовара.Записывать 		= Истина;
	Движения.ТоварыНаКомиссии.Записывать 	= Истина;
	Движения.Продажи.Записывать 			= Истина;
	//Движения.Долги.Записывать 				= Истина;
	
	Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл  
		
		// РН ОстаткиТовара
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= СкладКомиссии;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= - ТекСтрокаТовары.Количество; 

		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= Склад;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 
		
		// РН ТоварыНаКомиссии
		Движение = Движения.ТоварыНаКомиссии.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход; 
		Движение.Период 			= Дата;
 		Движение.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 			= ТекСтрокаТовары.Партия;
		Движение.Контрагент 		= Контрагент;
		Движение.Склад 				= СкладКомиссии;
        Движение.Количество			= - ТекСтрокаТовары.Количество;
        Движение.Сумма				= - ТекСтрокаТовары.СуммаНаКомиссии;
        Движение.СуммаКомиссионера	= - ТекСтрокаТовары.СуммаКомиссионера;

	КонецЦикла;

	//// РН Продажи
	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Ссылка", 		Ссылка);
	//Запр.УстановитьПараметр("Дата", 		Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	//Запр.УстановитьПараметр("Фирма", 		Фирма);
	//Запр.УстановитьПараметр("Контрагент", 	Контрагент);
	//// Отсекаем партии, которые были возвращены и не проданы повторно (оборот = 0)
	//Запр.Текст = "ВЫБРАТЬ
	//             |	ТоварыТЧ.Номенклатура КАК Номенклатура,
	//             |	ТоварыТЧ.Партия КАК Партия,
	//             |	ТоварыТЧ.Цена КАК Цена,
	//             |	ТоварыТЧ.Количество КАК Количество,
	//             |	ТоварыТЧ.Сумма КАК Сумма,
	//             |	Продажи.ДокументПрихода КАК ДокументПрихода,
	//             |	Продажи.Покупатель КАК Покупатель,
	//             |	Продажи.Поставщик КАК Поставщик,
	//             |	Продажи.Валюта КАК Валюта,
	//             |	Продажи.Автор КАК Автор,
	//             |	Продажи.Склад КАК Склад,
	//             |	Продажи.Фирма КАК Фирма,
	//             |	Продажи.КоличествоОборот КАК КоличествоОборот,
	//             |	Продажи.СуммаОборот КАК СуммаОборот,
	//             |	Продажи.НаценкаОборот КАК НаценкаОборот,
	//             |	Продажи.СуммаВБазВалютеОборот КАК СуммаВБазВалютеОборот,
	//             |	Продажи.НаценкаВБазВалютеОборот КАК НаценкаВБазВалютеОборот
	//             |ИЗ
	//             |	(ВЫБРАТЬ
	//             |		ВозвратСКомиссииТовары.Номенклатура КАК Номенклатура,
	//             |		ВозвратСКомиссииТовары.Серия КАК Серия,
	//             |		ВозвратСКомиссииТовары.Партия КАК Партия,
	//             |		ВозвратСКомиссииТовары.Цена КАК Цена,
	//             |		ВозвратСКомиссииТовары.Количество КАК Количество,
	//             |		ВозвратСКомиссииТовары.Сумма КАК Сумма
	//             |	ИЗ
	//             |		Документ.ВозвратСКомиссии.Товары КАК ВозвратСКомиссииТовары
	//             |	ГДЕ
	//             |		ВозвратСКомиссииТовары.Ссылка = &Ссылка) КАК ТоварыТЧ
	//             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//             |			ПродажиОбороты.Партия КАК Партия,
	//             |			ПродажиОбороты.ДокументПрихода КАК ДокументПрихода,
	//             |			ПродажиОбороты.Покупатель КАК Покупатель,
	//             |			ПродажиОбороты.Поставщик КАК Поставщик,
	//             |			ПродажиОбороты.Валюта КАК Валюта,
	//             |			ПродажиОбороты.Автор КАК Автор,
	//             |			ПродажиОбороты.Склад КАК Склад,
	//             |			ПродажиОбороты.Фирма КАК Фирма,
	//             |			ПродажиОбороты.КоличествоОборот КАК КоличествоОборот,
	//             |			ПродажиОбороты.СуммаОборот КАК СуммаОборот,
	//             |			ПродажиОбороты.НаценкаОборот КАК НаценкаОборот,
	//             |			ПродажиОбороты.СуммаВБазВалютеОборот КАК СуммаВБазВалютеОборот,
	//             |			ПродажиОбороты.НаценкаВБазВалютеОборот КАК НаценкаВБазВалютеОборот
	//             |		ИЗ
	//             |			РегистрНакопления.Продажи.Обороты(
	//             |					,
	//             |					&Дата,
	//             |					,
	//             |					Партия В
	//             |							(ВЫБРАТЬ
	//             |								ВозвратСКомиссииТовары.Партия
	//             |							ИЗ
	//             |								Документ.ВозвратСКомиссии.Товары КАК ВозвратСКомиссииТовары
	//             |							ГДЕ
	//             |								ВозвратСКомиссииТовары.Ссылка = &Ссылка)
	//             |						И Покупатель = &Контрагент
	//             |						И Фирма = &Фирма) КАК ПродажиОбороты
	//             |		ГДЕ
	//             |			ПродажиОбороты.КоличествоОборот > 0) КАК Продажи
	//             |		ПО ТоварыТЧ.Партия = Продажи.Партия";
	//РезультатЗапросаПродаж = Запр.Выполнить();
	//Выборка = РезультатЗапросаПродаж.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Движение = Движения.Продажи.Добавить(); 
	//	ЗаполнитьЗначенияСвойств(Движение, Выборка, "Номенклатура,Партия,ДокументПрихода,Покупатель,Поставщик,Валюта,Автор,Склад,Фирма");
	//	Движение.Период				= Дата;
	//	Движение.Количество			= - Выборка.Количество;
	//	К = Выборка.Количество / Выборка.КоличествоОборот;
	//	Движение.Сумма				= - Выборка.СуммаОборот * К;
	//	Движение.Наценка			= - Выборка.НаценкаОборот * К;
	//	Движение.СуммаВБазВалюте	= - Выборка.СуммаВБазВалютеОборот * К;
	//	Движение.НаценкаВБазВалюте	= - Выборка.НаценкаВБазВалютеОборот * К;
	//КонецЦикла;
	
	//// РН Долги  
	//Выгрузка = РезультатЗапросаПродаж.Выгрузить(); 
	//Выгрузка.Свернуть("Валюта", "СуммаОборот");
	//Для каждого СтрокаВыгрузки Из Выгрузка Цикл
	////Движение = Движения.Долги.ДобавитьПриход();
	////Движение.Период 				= Дата;
	////Движение.Фирма 					= Фирма;
	////Движение.Док 					= Ссылка;
	////Движение.Валюта 				= Валюта;
	////Движение.Контрагент 			= Контрагент;
	////Движение.ДолгПокупателя 		= - Доход;
	////Движение.ПредоплатаПокупателя 	= 0;
	////Движение.ДолгПоставщику 		= 0;
	////Движение.ПредоплатаПоставщику 	= 0;
	//КонецЦикла;

КонецПроцедуры

Процедура ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ)
	
	Ошибки = Новый СписокЗначений;
	
	// Запрет незаполненных установлен в свойствах реквизитов шапки
	//ПроведениеДокументов.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, "Контрагент,Склад,СкладКомиссии,Валюта", Отказ); 
	
	ПроведениеДокументов.ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки);
	ПроведениеДокументов.ПроверитьНаОстаткиТоваров(ТаблицаТовары, МоментВремени(), СкладКомиссии, Ошибки, Фирма);
		
	
	Для каждого Ош Из Ошибки Цикл
		Отказ = Истина;
		Сообщить(Ош.Значение);
	КонецЦикла; 
	
КонецПроцедуры

Функция ТаблицаТовары()

	//СтруктураПолей = Новый Структура;
	//СтруктураПолей.Вставить("Номенклатура",			"Номенклатура");
	//СтруктураПолей.Вставить("ТипНоменклатуры",		"Номенклатура.ТипНоменклатуры");
	//СтруктураПолей.Вставить("ЗапретОтгрузки",		"Номенклатура.ЗапретОтгрузки");
	//СтруктураПолей.Вставить("Серия",				"Серия");
	//СтруктураПолей.Вставить("Партия",				"Партия");
	//СтруктураПолей.Вставить("Количество",			"Количество");
	//СтруктураПолей.Вставить("ЦенаКомитента",		"Цена");
	//СтруктураПолей.Вставить("Сумма",				"Сумма");   
	//
	//ЗапросТовары = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	//ТаблицаТовары = ЗапросТовары.Выгрузить();
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", 	Ссылка);
	Запр.УстановитьПараметр("Дата", 	МоментВремени());
	Запр.УстановитьПараметр("Склад", 	СкладКомиссии);
	Запр.УстановитьПараметр("Контрагент", Контрагент);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТоварыТЧ.НомерСтроки КАК НомерСтроки,
	             |	ТоварыТЧ.Номенклатура КАК Номенклатура,
	             |	ТоварыТЧ.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	             |	ТоварыТЧ.Серия КАК Серия,
	             |	ТоварыТЧ.Партия КАК Партия,
	             |	ТоварыТЧ.Цена КАК Цена,
	             |	ТоварыТЧ.Количество КАК Количество,
	             |	ТоварыТЧ.Сумма КАК Сумма,
	             |	ТоварыТЧ.Партия.Контрагент КАК Поставщик,
	             |	ТоварыТЧ.Партия.Док КАК ДокументПрихода,
	             |	ЕСТЬNULL(ТоварыНаКомиссии.КоличествоОстаток, 0) КАК КоличествоНаКомиссии,
	             |	ЕСТЬNULL(ТоварыНаКомиссии.СуммаОстаток, 0) КАК СуммаНаКомиссии,
	             |	ЕСТЬNULL(ТоварыНаКомиссии.СуммаКомиссионераОстаток, 0) КАК СуммаКомиссионера
	             |ИЗ
	             |	Документ.ВозвратСКомиссии.Товары КАК ТоварыТЧ
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаКомиссии.Остатки(
	             |				&Дата,
	             |				Контрагент = &Контрагент
	             |					И Склад = &Склад) КАК ТоварыНаКомиссии
	             |		ПО ТоварыТЧ.Партия = ТоварыНаКомиссии.Партия
	             |ГДЕ
	             |	ТоварыТЧ.Ссылка = &Ссылка";

	ТаблицаТовары = Запр.Выполнить().Выгрузить(); 
	
    Возврат ТаблицаТовары;
	
КонецФункции
